<?php

return [

    /*
    |--------------------------------------------------------------------------
    | BOT NAME
    |--------------------------------------------------------------------------
    | Set bot name for Telegram SDK
    | Укажите имя бот для Telegram SDK
    |
     */
    'admin_email'         => '',
    /*
    |--------------------------------------------------------------------------
    | BOT NAME
    |--------------------------------------------------------------------------
    | Set bot name for Telegram SDK
    | Укажите имя бот для Telegram SDK
    |
     */
    'botname'             => '',
    /*
    |--------------------------------------------------------------------------
    | CHAT ID
    |--------------------------------------------------------------------------
    | Chat id you can find out through @RawDataBot
    | Chat id можете узнать у чат бота @RawDataBot
    |
     */
    'chat_id'             => '',
    /*
    |--------------------------------------------------------------------------
    | SAVE LOG
    |--------------------------------------------------------------------------
    | Save log in path storage/logs
    | Сохранять ошибки в storage/logs
    |
     */
    'save_log'            => true,
    /*
    |--------------------------------------------------------------------------
    | PATH SAVE TEMPORARY LOG
    |--------------------------------------------------------------------------
    | Set path save log temporary files
    | Укажите путь сохранения временнего файла лога
    |
     */
    'path_save'           => 'local',
    /*
    |--------------------------------------------------------------------------
    | LIMIT ERROR MESSAGE
    |--------------------------------------------------------------------------
    | Set limit message error. Default: 100
    | Укажите лимит длины сообщение ошибки. Поумолчанию: 100
    |
     */
    'limit_error_message' => 100,
];
