<?php

return [
    /*
    |--------------------------------------------------------------------------
    | CHAT ID
    |--------------------------------------------------------------------------
    | Chat id you can find out through @RawDataBot
    | Chat id можете узнать у чат бота @RawDataBot
    |
     */
    'chat_id'   => '',
    /*
    |--------------------------------------------------------------------------
    | SAVE LOG
    |--------------------------------------------------------------------------
    | Save log in path storage/logs
    | Сохранять ошибки в storage/logs
    |
     */
    'save_log'  => true,
    /*
    |--------------------------------------------------------------------------
    | PATH SAVE TEMPORARY LOG
    |--------------------------------------------------------------------------
    | Set path save log temporary files
    | Укажите путь сохранения временнего файла лога
    |
     */
    'path_save' => 'local',
];
